Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs.NewValue
The current item for the ComboBox after the change.

Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs.OldValue
The current item for the ComboBox before the change.

Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs
The event arguments used by ComboBox's CurrentChanged event.